zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213dxx_ca35.h
typedef struct
{
  __IO uint32_t PCR;             /*!< NAND Flash Programmable control register               Address offset: 0x080 */
  __IO uint32_t SR;              /*!< FMC status register                                    Address offset: 0x084 */
  __IO uint32_t PMEM;            /*!< Common memory space timing register                    Address offset: 0x088 */
  __IO uint32_t PATT;            /*!< Attribute memory space timing registers                Address offset: 0x08C */
  __IO uint32_t HPR;             /*!< FMC Hamming parity result registers                    Address offset: 0x090 */
  __IO uint32_t HECCR;           /*!< FMC Hamming code ECC result register                   Address offset: 0x094 */
       uint32_t RESERVED0[58];   /*!< Reserved                                               Address offset: 0x098-0x17C */
  __IO uint32_t IER;             /*!< FMC NAND Interrupt Enable Register                     Address offset: 0x180 */
  __IO uint32_t ISR;             /*!< FMC Controller Interrupt Status Register               Address offset: 0x184 */
  __IO uint32_t ICR;             /*!< FMC NAND Controller Interrupt Clear Register           Address offset: 0x188 */
       uint32_t RESERVED1[29];   /*!< Reserved                                               Address offset: 0x18C-0x1FC */
  __IO uint32_t CSQCR;           /*!< FMC NAND Command Sequencer Control Register            Address offset: 0x200 */
  __IO uint32_t CSQCFGR1;        /*!< FMC NAND Command Sequencer Configuration Register 1    Address offset: 0x204 */
  __IO uint32_t CSQCFGR2;        /*!< FMC NAND Command Sequencer Configuration Register 2    Address offset: 0x208 */
  __IO uint32_t CSQCFGR3;        /*!< FMC NAND sequencer configuration register 3            Address offset: 0x20C */
  __IO uint32_t CSQAR1;          /*!< FMC NAND Command Sequencer Address Register 1          Address offset: 0x210 */
  __IO uint32_t CSQAR2;          /*!< FMC NAND Command Sequencer Address Register 2          Address offset: 0x214 */
       uint32_t RESERVED2[2];    /*!< Reserved                                               Address offset: 0x218-0x21C */
  __IO uint32_t CSQIER;          /*!< FMC NAND Command Sequencer Interrupt Enable Register   Address offset: 0x220 */
  __IO uint32_t CSQISR;          /*!< FMC NAND Command Sequencer Interrupt Status Register   Address offset: 0x224 */
  __IO uint32_t CSQICR;          /*!< FMC NAND Command Sequencer Interrupt Clear Register    Address offset: 0x228 */
       uint32_t RESERVED3;       /*!< Reserved                                               Address offset: 0x22C */
  __IO uint32_t CSQEMSR;         /*!< FMC Command Sequencer Error Mapping Status register    Address offset: 0x230 */
       uint32_t RESERVED4[7];    /*!< Reserved                                               Address offset: 0x234-0x24C */
  __IO uint32_t BCHIER;          /*!< FMC BCH Interrupt enable register                      Address offset: 0x250 */
  __IO uint32_t BCHISR;          /*!< FMC BCH Interrupt and Status Register                  Address offset: 0x254 */
  __IO uint32_t BCHICR;          /*!< FMC BCH Interrupt Clear Register                       Address offset: 0x258 */
       uint32_t RESERVED5;       /*!< Reserved                                               Address offset: 0x25C */
  __IO uint32_t BCHPBR1;         /*!< FMC BCH Parity Bits Register 1                         Address offset: 0x260 */
  __IO uint32_t BCHPBR2;         /*!< FMC BCH Parity Bits Register 2                         Address offset: 0x264 */
  __IO uint32_t BCHPBR3;         /*!< FMC BCH Parity Bits Register 3                         Address offset: 0x268 */
  __IO uint32_t BCHPBR4;         /*!< FMC BCH Parity Bits Register 4                         Address offset: 0x26C */
       uint32_t RESERVED6[3];    /*!< Reserved                                               Address offset: 0x270-0x278 */
  __IO uint32_t BCHDSR0;         /*!< FMC BCH Decoder Status register 0                      Address offset: 0x27C */
  __IO uint32_t BCHDSR1;         /*!< FMC BCH Decoder Status register for bank 1             Address offset: 0x280 */
  __IO uint32_t BCHDSR2;         /*!< FMC BCH Decoder Status register for bank 2             Address offset: 0x284 */
  __IO uint32_t BCHDSR3;         /*!< FMC BCH Decoder Status register for bank 3             Address offset: 0x288 */
  __IO uint32_t BCHDSR4;         /*!< FMC BCH Decoder Status register for bank 4             Address offset: 0x28C */
       uint32_t RESERVED7[28];   /*!< Reserved                                               Address offset: 0x290-0x2FC */
} FMC_Bank3_TypeDef;

/**
  * @brief Flexible Memory Controller Common
  */

typedef struct{
  __IO uint32_t CFGR;            /*!< FMC common configuration register                      Address offset: 0x020 */
       uint32_t RESERVED0[183];  /*!< Reserved                                               Address offset: 0x024-0x2FC */
  __IO uint32_t SECCFGR;         /*!< FMC security configuration register                    Address offset: 0x300 */
  __IO uint32_t PRIVCFGR;        /*!< FMC security configuration register                    Address offset: 0x304 */
  __IO uint32_t RCFGLOCK;        /*!< FMC CID configuration lock register                    Address offset: 0x308 */
  __IO uint32_t CIDCFGR0;        /*!< FMC resource 0 CID Register                            Address offset: 0x30C */
  __IO uint32_t SEMCR0;          /*!< FMC Resource 0 Semaphore Control Register              Address offset: 0x310 */
  __IO uint32_t CIDCFGR1;        /*!< FMC resource 1 CID Register                            Address offset: 0x314 */
  __IO uint32_t SEMCR1;          /*!< FMC Resource 1 Semaphore Control Register              Address offset: 0x318 */
  __IO uint32_t CIDCFGR2;        /*!< FMC resource 2 CID Register                            Address offset: 0x31C */
  __IO uint32_t SEMCR2;          /*!< FMC Resource 2 Semaphore Control Register              Address offset: 0x320 */
  __IO uint32_t CIDCFGR3;        /*!< FMC resource 3 CID Register                            Address offset: 0x324 */
  __IO uint32_t SEMCR3;          /*!< FMC Resource 3 Semaphore Control Register              Address offset: 0x328 */
  __IO uint32_t CIDCFGR4;        /*!< FMC resource 4 CID Register                            Address offset: 0x32C */
  __IO uint32_t SEMCR4;          /*!< FMC Resource 4 Semaphore Control Register              Address offset: 0x330 */
  __IO uint32_t CIDCFGR5;        /*!< FMC resource 5 CID Register                            Address offset: 0x334 */
  __IO uint32_t SEMCR5;          /*!< FMC Resource 5 Semaphore Control Register              Address offset: 0x338 */
       uint32_t RESERVED1[43];   /*!< Reserved                                               Address offset: 0x33C-0x3E4 */
  __IO uint32_t HWCFGR3;         /*!< FMC Hardware configuration register 3                  Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< FMC Hardware configuration register 2                  Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< FMC Hardware configuration register 1                  Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< FMC Version register                                   Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< FMC Identification register                            Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< FMC Size Identification register                       Address offset: 0x3FC */
} FMC_Common_TypeDef;

