zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213dxx_ca35.h
/****************  Bit definition for DTS_TSCSDIF_SR register  ****************/
#define DTS_TSCSDIF_SR_SDIF_BUSY_Pos                (0U)
#define DTS_TSCSDIF_SR_SDIF_BUSY_Msk                (0x1UL << DTS_TSCSDIF_SR_SDIF_BUSY_Pos)               /*!< 0x00000001 */
#define DTS_TSCSDIF_SR_SDIF_BUSY                    DTS_TSCSDIF_SR_SDIF_BUSY_Msk                         /*!< SDIF busy flag */
#define DTS_TSCSDIF_SR_SDIF_LOCK_Pos                (1U)
#define DTS_TSCSDIF_SR_SDIF_LOCK_Msk                (0x1UL << DTS_TSCSDIF_SR_SDIF_LOCK_Pos)               /*!< 0x00000002 */
#define DTS_TSCSDIF_SR_SDIF_LOCK                    DTS_TSCSDIF_SR_SDIF_LOCK_Msk                         /*!< SDIF locked flag */

/****************  Bit definition for DTS_TSCSDIF_CR register  ****************/
#define DTS_TSCSDIF_CR_SDIF_WDATA_Pos               (0U)
#define DTS_TSCSDIF_CR_SDIF_WDATA_Msk               (0xFFFFFFUL << DTS_TSCSDIF_CR_SDIF_WDATA_Pos)         /*!< 0x00FFFFFF */
#define DTS_TSCSDIF_CR_SDIF_WDATA                   DTS_TSCSDIF_CR_SDIF_WDATA_Msk                        /*!< Serial interface write data */
#define DTS_TSCSDIF_CR_SDIF_ADDR_Pos                (24U)
#define DTS_TSCSDIF_CR_SDIF_ADDR_Msk                (0x7UL << DTS_TSCSDIF_CR_SDIF_ADDR_Pos)               /*!< 0x07000000 */
#define DTS_TSCSDIF_CR_SDIF_ADDR                    DTS_TSCSDIF_CR_SDIF_ADDR_Msk                         /*!< Serial interface register address */
#define DTS_TSCSDIF_CR_SDIF_WRN_Pos                 (27U)
#define DTS_TSCSDIF_CR_SDIF_WRN_Msk                 (0x1UL << DTS_TSCSDIF_CR_SDIF_WRN_Pos)                /*!< 0x08000000 */
#define DTS_TSCSDIF_CR_SDIF_WRN                     DTS_TSCSDIF_CR_SDIF_WRN_Msk                          /*!< Serial interface write/no read control bit */
#define DTS_TSCSDIF_CR_SDIF_PROG_Pos                (31U)
#define DTS_TSCSDIF_CR_SDIF_PROG_Msk                (0x1UL << DTS_TSCSDIF_CR_SDIF_PROG_Pos)               /*!< 0x80000000 */
#define DTS_TSCSDIF_CR_SDIF_PROG                    DTS_TSCSDIF_CR_SDIF_PROG_Msk                         /*!< Serial interface program request */

/***************  Bit definition for DTS_TSCSDIFHALTR register  ***************/
#define DTS_TSCSDIFHALTR_SDIF_STOP_Pos              (0U)
#define DTS_TSCSDIFHALTR_SDIF_STOP_Msk              (0x1UL << DTS_TSCSDIFHALTR_SDIF_STOP_Pos)             /*!< 0x00000001 */
#define DTS_TSCSDIFHALTR_SDIF_STOP                  DTS_TSCSDIFHALTR_SDIF_STOP_Msk                       /*!< Serial data interface (SDIF) stop  */

/***************  Bit definition for DTS_TSCSDIF_CFGR register  ***************/
#define DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Pos           (0U)
#define DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Msk           (0x3UL << DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Pos)          /*!< 0x00000003 */
#define DTS_TSCSDIF_CFGR_SDIF_INHIBIT               DTS_TSCSDIF_CFGR_SDIF_INHIBIT_Msk                    /*!< Serial data interface (SDIF) programming inhibit  */

/****************  Bit definition for DTS_TSCSMPL_CR register  ****************/
#define DTS_TSCSMPL_CR_SMPL_CTR_DISABLE_Pos         (0U)
#define DTS_TSCSMPL_CR_SMPL_CTR_DISABLE_Msk         (0x1UL << DTS_TSCSMPL_CR_SMPL_CTR_DISABLE_Pos)        /*!< 0x00000001 */
#define DTS_TSCSMPL_CR_SMPL_CTR_DISABLE             DTS_TSCSMPL_CR_SMPL_CTR_DISABLE_Msk                  /*!< Sample counter disable bit */
#define DTS_TSCSMPL_CR_SMPL_CTR_HOLD_Pos            (1U)
#define DTS_TSCSMPL_CR_SMPL_CTR_HOLD_Msk            (0x1UL << DTS_TSCSMPL_CR_SMPL_CTR_HOLD_Pos)           /*!< 0x00000002 */
#define DTS_TSCSMPL_CR_SMPL_CTR_HOLD                DTS_TSCSMPL_CR_SMPL_CTR_HOLD_Msk                     /*!< Sample counter hold bit */
#define DTS_TSCSMPL_CR_SMPL_DISCARD_Pos             (2U)
#define DTS_TSCSMPL_CR_SMPL_DISCARD_Msk             (0x1UL << DTS_TSCSMPL_CR_SMPL_DISCARD_Pos)            /*!< 0x00000004 */
#define DTS_TSCSMPL_CR_SMPL_DISCARD                 DTS_TSCSMPL_CR_SMPL_DISCARD_Msk                      /*!< Sample discard bit */

/*************  Bit definition for DTS_TSCSDIFSMPLCLRR register  **************/
#define DTS_TSCSDIFSMPLCLRR_SMPL_CNTER_CLEAR_Pos    (0U)
#define DTS_TSCSDIFSMPLCLRR_SMPL_CNTER_CLEAR_Msk    (0x1UL << DTS_TSCSDIFSMPLCLRR_SMPL_CNTER_CLEAR_Pos)   /*!< 0x00000001 */
#define DTS_TSCSDIFSMPLCLRR_SMPL_CNTER_CLEAR        DTS_TSCSDIFSMPLCLRR_SMPL_CNTER_CLEAR_Msk             /*!< Sample counter clear bit  */

/***************  Bit definition for DTS_TSCSMPLCNTR register  ****************/
#define DTS_TSCSMPLCNTR_SMPL_COUNT_Pos              (0U)
#define DTS_TSCSMPLCNTR_SMPL_COUNT_Msk              (0xFFFFUL << DTS_TSCSMPLCNTR_SMPL_COUNT_Pos)          /*!< 0x0000FFFF */
#define DTS_TSCSMPLCNTR_SMPL_COUNT                  DTS_TSCSMPLCNTR_SMPL_COUNT_Msk                       /*!< Sample counter */

/*****************  Bit definition for DTS_TS0_IER register  ******************/
#define DTS_TS0_IER_IRQ_EN_FAULT_Pos                (0U)
#define DTS_TS0_IER_IRQ_EN_FAULT_Msk                (0x1UL << DTS_TS0_IER_IRQ_EN_FAULT_Pos)               /*!< 0x00000001 */
#define DTS_TS0_IER_IRQ_EN_FAULT                    DTS_TS0_IER_IRQ_EN_FAULT_Msk                         /*!< Fault IRQ enable bit */
#define DTS_TS0_IER_IRQ_EN_DONE_Pos                 (1U)
#define DTS_TS0_IER_IRQ_EN_DONE_Msk                 (0x1UL << DTS_TS0_IER_IRQ_EN_DONE_Pos)                /*!< 0x00000002 */
#define DTS_TS0_IER_IRQ_EN_DONE                     DTS_TS0_IER_IRQ_EN_DONE_Msk                          /*!< Sample done IRQ enable bit */
#define DTS_TS0_IER_IRQ_EN_ALARMA_Pos               (3U)
#define DTS_TS0_IER_IRQ_EN_ALARMA_Msk               (0x1UL << DTS_TS0_IER_IRQ_EN_ALARMA_Pos)              /*!< 0x00000008 */
#define DTS_TS0_IER_IRQ_EN_ALARMA                   DTS_TS0_IER_IRQ_EN_ALARMA_Msk                        /*!< Alarm A IRQ enable bit */
#define DTS_TS0_IER_IRQ_EN_ALARMB_Pos               (4U)
#define DTS_TS0_IER_IRQ_EN_ALARMB_Msk               (0x1UL << DTS_TS0_IER_IRQ_EN_ALARMB_Pos)              /*!< 0x00000010 */
#define DTS_TS0_IER_IRQ_EN_ALARMB                   DTS_TS0_IER_IRQ_EN_ALARMB_Msk                        /*!< Alarm B IRQ enable bit */

/*****************  Bit definition for DTS_TS0_ISR register  ******************/
#define DTS_TS0_ISR_IRQ_STATUS_FAULT_Pos            (0U)
#define DTS_TS0_ISR_IRQ_STATUS_FAULT_Msk            (0x1UL << DTS_TS0_ISR_IRQ_STATUS_FAULT_Pos)           /*!< 0x00000001 */
#define DTS_TS0_ISR_IRQ_STATUS_FAULT                DTS_TS0_ISR_IRQ_STATUS_FAULT_Msk                     /*!< Fault IRQ status bit */
#define DTS_TS0_ISR_IRQ_STATUS_DONE_Pos             (1U)
#define DTS_TS0_ISR_IRQ_STATUS_DONE_Msk             (0x1UL << DTS_TS0_ISR_IRQ_STATUS_DONE_Pos)            /*!< 0x00000002 */
#define DTS_TS0_ISR_IRQ_STATUS_DONE                 DTS_TS0_ISR_IRQ_STATUS_DONE_Msk                      /*!< Sample done IRQ status bit */
#define DTS_TS0_ISR_IRQ_STATUS_ALARMA_Pos           (3U)
#define DTS_TS0_ISR_IRQ_STATUS_ALARMA_Msk           (0x1UL << DTS_TS0_ISR_IRQ_STATUS_ALARMA_Pos)          /*!< 0x00000008 */
#define DTS_TS0_ISR_IRQ_STATUS_ALARMA               DTS_TS0_ISR_IRQ_STATUS_ALARMA_Msk                    /*!< Alarm A IRQ status bit */
#define DTS_TS0_ISR_IRQ_STATUS_ALARMB_Pos           (4U)
#define DTS_TS0_ISR_IRQ_STATUS_ALARMB_Msk           (0x1UL << DTS_TS0_ISR_IRQ_STATUS_ALARMB_Pos)          /*!< 0x00000010 */
#define DTS_TS0_ISR_IRQ_STATUS_ALARMB               DTS_TS0_ISR_IRQ_STATUS_ALARMB_Msk                    /*!< Alarm B IRQ status bit */

/*****************  Bit definition for DTS_TS0_ICR register  ******************/
#define DTS_TS0_ICR_IRQ_CLEAR_FAULT_Pos             (0U)
#define DTS_TS0_ICR_IRQ_CLEAR_FAULT_Msk             (0x1UL << DTS_TS0_ICR_IRQ_CLEAR_FAULT_Pos)            /*!< 0x00000001 */
#define DTS_TS0_ICR_IRQ_CLEAR_FAULT                 DTS_TS0_ICR_IRQ_CLEAR_FAULT_Msk                      /*!< Fault IRQ clear bit */
#define DTS_TS0_ICR_IRQ_CLEAR_DONE_Pos              (1U)
#define DTS_TS0_ICR_IRQ_CLEAR_DONE_Msk              (0x1UL << DTS_TS0_ICR_IRQ_CLEAR_DONE_Pos)             /*!< 0x00000002 */
#define DTS_TS0_ICR_IRQ_CLEAR_DONE                  DTS_TS0_ICR_IRQ_CLEAR_DONE_Msk                       /*!< Sample done IRQ clear bit */
#define DTS_TS0_ICR_IRQ_CLEAR_ALARMA_Pos            (3U)
#define DTS_TS0_ICR_IRQ_CLEAR_ALARMA_Msk            (0x1UL << DTS_TS0_ICR_IRQ_CLEAR_ALARMA_Pos)           /*!< 0x00000008 */
#define DTS_TS0_ICR_IRQ_CLEAR_ALARMA                DTS_TS0_ICR_IRQ_CLEAR_ALARMA_Msk                     /*!< Alarm A IRQ clear bit */
#define DTS_TS0_ICR_IRQ_CLEAR_ALARMB_Pos            (4U)
#define DTS_TS0_ICR_IRQ_CLEAR_ALARMB_Msk            (0x1UL << DTS_TS0_ICR_IRQ_CLEAR_ALARMB_Pos)           /*!< 0x00000010 */
#define DTS_TS0_ICR_IRQ_CLEAR_ALARMB                DTS_TS0_ICR_IRQ_CLEAR_ALARMB_Msk                     /*!< Alarm B IRQ clear bit */

/***************  Bit definition for DTS_TS0IRQTESTR register  ****************/
#define DTS_TS0IRQTESTR_IRQ_TEST_FAULT_Pos          (0U)
#define DTS_TS0IRQTESTR_IRQ_TEST_FAULT_Msk          (0x1UL << DTS_TS0IRQTESTR_IRQ_TEST_FAULT_Pos)         /*!< 0x00000001 */
#define DTS_TS0IRQTESTR_IRQ_TEST_FAULT              DTS_TS0IRQTESTR_IRQ_TEST_FAULT_Msk                   /*!< Fault IRQ test bit */
#define DTS_TS0IRQTESTR_IRQ_TEST_DONE_Pos           (1U)
#define DTS_TS0IRQTESTR_IRQ_TEST_DONE_Msk           (0x1UL << DTS_TS0IRQTESTR_IRQ_TEST_DONE_Pos)          /*!< 0x00000002 */
#define DTS_TS0IRQTESTR_IRQ_TEST_DONE               DTS_TS0IRQTESTR_IRQ_TEST_DONE_Msk                    /*!< Sample done IRQ test bit */
#define DTS_TS0IRQTESTR_IRQ_TEST_ALARMA_Pos         (3U)
#define DTS_TS0IRQTESTR_IRQ_TEST_ALARMA_Msk         (0x1UL << DTS_TS0IRQTESTR_IRQ_TEST_ALARMA_Pos)        /*!< 0x00000008 */
#define DTS_TS0IRQTESTR_IRQ_TEST_ALARMA             DTS_TS0IRQTESTR_IRQ_TEST_ALARMA_Msk                  /*!< Alarm A IRQ test bit */
#define DTS_TS0IRQTESTR_IRQ_TEST_ALARMB_Pos         (4U)
#define DTS_TS0IRQTESTR_IRQ_TEST_ALARMB_Msk         (0x1UL << DTS_TS0IRQTESTR_IRQ_TEST_ALARMB_Pos)        /*!< 0x00000010 */
#define DTS_TS0IRQTESTR_IRQ_TEST_ALARMB             DTS_TS0IRQTESTR_IRQ_TEST_ALARMB_Msk                  /*!< Alarm B IRQ test bit */

/**************  Bit definition for DTS_TS0SDIFRDATAR register  ***************/
#define DTS_TS0SDIFRDATAR_SDIF_RDATA_Pos            (0U)
#define DTS_TS0SDIFRDATAR_SDIF_RDATA_Msk            (0xFFFFFFUL << DTS_TS0SDIFRDATAR_SDIF_RDATA_Pos)      /*!< 0x00FFFFFF */
#define DTS_TS0SDIFRDATAR_SDIF_RDATA                DTS_TS0SDIFRDATAR_SDIF_RDATA_Msk                     /*!< SDIF read data */

