zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213dxx_ca35.h
/******************  Bit definition for ETH_ACMMSG_RESETCTRLLOW register  *******************/
#define ETH_ACMMSG_RESETCTRLLOW_Pos         (0U)
#define ETH_ACMMSG_RESETCTRLLOW_Msk         (0xFFFFFFFFUL << ETH_ACMMSG_RESETCTRLLOW_Pos)    /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_RESETCTRLLOW             ETH_ACMMSG_RESETCTRLLOW_Msk                     /*!< Reset control low */
#define ETH_ACMMSG_RESETCTRLLOW_0           (0x1UL << ETH_ACMMSG_RESETCTRLLOW_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_RESETCTRLLOW_1           (0x2UL << ETH_ACMMSG_RESETCTRLLOW_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_RESETCTRLLOW_2           (0x4UL << ETH_ACMMSG_RESETCTRLLOW_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_RESETCTRLLOW_3           (0x8UL << ETH_ACMMSG_RESETCTRLLOW_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_RESETCTRLLOW_4           (0x10UL << ETH_ACMMSG_RESETCTRLLOW_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_RESETCTRLLOW_5           (0x20UL << ETH_ACMMSG_RESETCTRLLOW_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_RESETCTRLLOW_6           (0x40UL << ETH_ACMMSG_RESETCTRLLOW_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_RESETCTRLLOW_7           (0x80UL << ETH_ACMMSG_RESETCTRLLOW_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_RESETCTRLLOW_8           (0x100UL << ETH_ACMMSG_RESETCTRLLOW_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_RESETCTRLLOW_9           (0x200UL << ETH_ACMMSG_RESETCTRLLOW_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_RESETCTRLLOW_10          (0x400UL << ETH_ACMMSG_RESETCTRLLOW_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_RESETCTRLLOW_11          (0x800UL << ETH_ACMMSG_RESETCTRLLOW_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_RESETCTRLLOW_12          (0x1000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_RESETCTRLLOW_13          (0x2000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_RESETCTRLLOW_14          (0x4000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_RESETCTRLLOW_15          (0x8000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_RESETCTRLLOW_16          (0x10000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_RESETCTRLLOW_17          (0x20000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_RESETCTRLLOW_18          (0x40000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_RESETCTRLLOW_19          (0x80000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_RESETCTRLLOW_20          (0x100000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_RESETCTRLLOW_21          (0x200000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_RESETCTRLLOW_22          (0x400000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_RESETCTRLLOW_23          (0x800000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_RESETCTRLLOW_24          (0x1000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_RESETCTRLLOW_25          (0x2000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_RESETCTRLLOW_26          (0x4000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_RESETCTRLLOW_27          (0x8000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_RESETCTRLLOW_28          (0x10000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_RESETCTRLLOW_29          (0x20000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_RESETCTRLLOW_30          (0x40000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_RESETCTRLLOW_31          (0x80000000UL << ETH_ACMMSG_RESETCTRLLOW_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_RESETCTRLHIGH register  *******************/
#define ETH_ACMMSG_RESETCTRLHIGH_Pos        (0U)
#define ETH_ACMMSG_RESETCTRLHIGH_Msk        (0xFFFFFFFFUL << ETH_ACMMSG_RESETCTRLHIGH_Pos)    /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_RESETCTRLHIGH            ETH_ACMMSG_RESETCTRLHIGH_Msk                     /*!< Reset control high */
#define ETH_ACMMSG_RESETCTRLHIGH_0          (0x1UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_RESETCTRLHIGH_1          (0x2UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_RESETCTRLHIGH_2          (0x4UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_RESETCTRLHIGH_3          (0x8UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_RESETCTRLHIGH_4          (0x10UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_RESETCTRLHIGH_5          (0x20UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_RESETCTRLHIGH_6          (0x40UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_RESETCTRLHIGH_7          (0x80UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_RESETCTRLHIGH_8          (0x100UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_RESETCTRLHIGH_9          (0x200UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_RESETCTRLHIGH_10         (0x400UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_RESETCTRLHIGH_11         (0x800UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_RESETCTRLHIGH_12         (0x1000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_RESETCTRLHIGH_13         (0x2000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_RESETCTRLHIGH_14         (0x4000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_RESETCTRLHIGH_15         (0x8000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_RESETCTRLHIGH_16         (0x10000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_RESETCTRLHIGH_17         (0x20000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_RESETCTRLHIGH_18         (0x40000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_RESETCTRLHIGH_19         (0x80000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_RESETCTRLHIGH_20         (0x100000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_RESETCTRLHIGH_21         (0x200000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_RESETCTRLHIGH_22         (0x400000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_RESETCTRLHIGH_23         (0x800000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_RESETCTRLHIGH_24         (0x1000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_25         (0x2000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_26         (0x4000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_27         (0x8000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_28         (0x10000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_29         (0x20000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_30         (0x40000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_RESETCTRLHIGH_31         (0x80000000UL << ETH_ACMMSG_RESETCTRLHIGH_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_IRQSTATUSLOW register  *******************/
#define ETH_ACMMSG_IRQSTATUSLOW_Pos         (0U)
#define ETH_ACMMSG_IRQSTATUSLOW_Msk         (0xFFFFFFFFUL << ETH_ACMMSG_IRQSTATUSLOW_Pos)    /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_IRQSTATUSLOW             ETH_ACMMSG_IRQSTATUSLOW_Msk                     /*!< IRQ Status low */
#define ETH_ACMMSG_IRQSTATUSLOW_0           (0x1UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_IRQSTATUSLOW_1           (0x2UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_IRQSTATUSLOW_2           (0x4UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_IRQSTATUSLOW_3           (0x8UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_IRQSTATUSLOW_4           (0x10UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_IRQSTATUSLOW_5           (0x20UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_IRQSTATUSLOW_6           (0x40UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_IRQSTATUSLOW_7           (0x80UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_IRQSTATUSLOW_8           (0x100UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_IRQSTATUSLOW_9           (0x200UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_IRQSTATUSLOW_10          (0x400UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_IRQSTATUSLOW_11          (0x800UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_IRQSTATUSLOW_12          (0x1000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_IRQSTATUSLOW_13          (0x2000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_IRQSTATUSLOW_14          (0x4000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_IRQSTATUSLOW_15          (0x8000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_IRQSTATUSLOW_16          (0x10000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_IRQSTATUSLOW_17          (0x20000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_IRQSTATUSLOW_18          (0x40000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_IRQSTATUSLOW_19          (0x80000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_IRQSTATUSLOW_20          (0x100000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_IRQSTATUSLOW_21          (0x200000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_IRQSTATUSLOW_22          (0x400000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_IRQSTATUSLOW_23          (0x800000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_IRQSTATUSLOW_24          (0x1000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_25          (0x2000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_26          (0x4000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_27          (0x8000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_28          (0x10000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_29          (0x20000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_30          (0x40000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_IRQSTATUSLOW_31          (0x80000000UL << ETH_ACMMSG_IRQSTATUSLOW_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_IRQSTATUSHIGH register  *******************/
#define ETH_ACMMSG_IRQSTATUSHIGH_Pos        (0U)
#define ETH_ACMMSG_IRQSTATUSHIGH_Msk        (0xFFFFFFFFUL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)    /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_IRQSTATUSHIGH            ETH_ACMMSG_IRQSTATUSHIGH_Msk                     /*!< IRQ Status high */
#define ETH_ACMMSG_IRQSTATUSHIGH_0          (0x1UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_IRQSTATUSHIGH_1          (0x2UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_IRQSTATUSHIGH_2          (0x4UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_IRQSTATUSHIGH_3          (0x8UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_IRQSTATUSHIGH_4          (0x10UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_IRQSTATUSHIGH_5          (0x20UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_IRQSTATUSHIGH_6          (0x40UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_IRQSTATUSHIGH_7          (0x80UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_IRQSTATUSHIGH_8          (0x100UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_IRQSTATUSHIGH_9          (0x200UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_IRQSTATUSHIGH_10         (0x400UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_IRQSTATUSHIGH_11         (0x800UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_IRQSTATUSHIGH_12         (0x1000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_13         (0x2000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_14         (0x4000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_15         (0x8000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_16         (0x10000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_17         (0x20000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_18         (0x40000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_19         (0x80000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_20         (0x100000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_21         (0x200000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_22         (0x400000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_23         (0x800000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_24         (0x1000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_25         (0x2000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_26         (0x4000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_27         (0x8000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_28         (0x10000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_29         (0x20000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_30         (0x40000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_IRQSTATUSHIGH_31         (0x80000000UL << ETH_ACMMSG_IRQSTATUSHIGH_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_IRQTESTLOW register  *******************/
#define ETH_ACMMSG_IRQTESTLOW_Pos           (0U)
#define ETH_ACMMSG_IRQTESTLOW_Msk           (0xFFFFFFFFUL << ETH_ACMMSG_IRQTESTLOW_Pos)    /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_IRQTESTLOW               ETH_ACMMSG_IRQTESTLOW_Msk                     /*!< IRQ Test low */
#define ETH_ACMMSG_IRQTESTLOW_0             (0x1UL << ETH_ACMMSG_IRQTESTLOW_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_IRQTESTLOW_1             (0x2UL << ETH_ACMMSG_IRQTESTLOW_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_IRQTESTLOW_2             (0x4UL << ETH_ACMMSG_IRQTESTLOW_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_IRQTESTLOW_3             (0x8UL << ETH_ACMMSG_IRQTESTLOW_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_IRQTESTLOW_4             (0x10UL << ETH_ACMMSG_IRQTESTLOW_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_IRQTESTLOW_5             (0x20UL << ETH_ACMMSG_IRQTESTLOW_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_IRQTESTLOW_6             (0x40UL << ETH_ACMMSG_IRQTESTLOW_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_IRQTESTLOW_7             (0x80UL << ETH_ACMMSG_IRQTESTLOW_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_IRQTESTLOW_8             (0x100UL << ETH_ACMMSG_IRQTESTLOW_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_IRQTESTLOW_9             (0x200UL << ETH_ACMMSG_IRQTESTLOW_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_IRQTESTLOW_10            (0x400UL << ETH_ACMMSG_IRQTESTLOW_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_IRQTESTLOW_11            (0x800UL << ETH_ACMMSG_IRQTESTLOW_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_IRQTESTLOW_12            (0x1000UL << ETH_ACMMSG_IRQTESTLOW_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_IRQTESTLOW_13            (0x2000UL << ETH_ACMMSG_IRQTESTLOW_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_IRQTESTLOW_14            (0x4000UL << ETH_ACMMSG_IRQTESTLOW_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_IRQTESTLOW_15            (0x8000UL << ETH_ACMMSG_IRQTESTLOW_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_IRQTESTLOW_16            (0x10000UL << ETH_ACMMSG_IRQTESTLOW_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_IRQTESTLOW_17            (0x20000UL << ETH_ACMMSG_IRQTESTLOW_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_IRQTESTLOW_18            (0x40000UL << ETH_ACMMSG_IRQTESTLOW_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_IRQTESTLOW_19            (0x80000UL << ETH_ACMMSG_IRQTESTLOW_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_IRQTESTLOW_20            (0x100000UL << ETH_ACMMSG_IRQTESTLOW_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_IRQTESTLOW_21            (0x200000UL << ETH_ACMMSG_IRQTESTLOW_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_IRQTESTLOW_22            (0x400000UL << ETH_ACMMSG_IRQTESTLOW_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_IRQTESTLOW_23            (0x800000UL << ETH_ACMMSG_IRQTESTLOW_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_IRQTESTLOW_24            (0x1000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_IRQTESTLOW_25            (0x2000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_IRQTESTLOW_26            (0x4000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_IRQTESTLOW_27            (0x8000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_IRQTESTLOW_28            (0x10000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_IRQTESTLOW_29            (0x20000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_IRQTESTLOW_30            (0x40000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_IRQTESTLOW_31            (0x80000000UL << ETH_ACMMSG_IRQTESTLOW_Pos)    /*!< 0x80000000 */

