zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp213dxx_ca35.h
/* Bit fields for RCC_PLL2CFGR1 register */
#define RCC_PLL2CFGR1_SSMODRST_Pos                 (0U)
#define RCC_PLL2CFGR1_SSMODRST_Msk                 (0x1UL << RCC_PLL2CFGR1_SSMODRST_Pos)                /*!< 0x00000001 */
#define RCC_PLL2CFGR1_SSMODRST                     RCC_PLL2CFGR1_SSMODRST_Msk                        /*!< PLLx spread-spectrum modulator reset */
#define RCC_PLL2CFGR1_PLLEN_Pos                    (8U)
#define RCC_PLL2CFGR1_PLLEN_Msk                    (0x1UL << RCC_PLL2CFGR1_PLLEN_Pos)                   /*!< 0x00000100 */
#define RCC_PLL2CFGR1_PLLEN                        RCC_PLL2CFGR1_PLLEN_Msk                           /*!< PLLx enable */
#define RCC_PLL2CFGR1_PLLRDY_Pos                   (24U)
#define RCC_PLL2CFGR1_PLLRDY_Msk                   (0x1UL << RCC_PLL2CFGR1_PLLRDY_Pos)                  /*!< 0x01000000 */
#define RCC_PLL2CFGR1_PLLRDY                       RCC_PLL2CFGR1_PLLRDY_Msk                          /*!< PLLx clock ready flag */
#define RCC_PLL2CFGR1_CKREFST_Pos                  (28U)
#define RCC_PLL2CFGR1_CKREFST_Msk                  (0x1UL << RCC_PLL2CFGR1_CKREFST_Pos)                 /*!< 0x10000000 */
#define RCC_PLL2CFGR1_CKREFST                      RCC_PLL2CFGR1_CKREFST_Msk                         /*!< PLLx reference clock state */

/* Bit fields for RCC_PLL2CFGR2 register */
#define RCC_PLL2CFGR2_FREFDIV_Pos                  (0U)
#define RCC_PLL2CFGR2_FREFDIV_Msk                  (0x3FUL << RCC_PLL2CFGR2_FREFDIV_Pos)                /*!< 0x0000003F */
#define RCC_PLL2CFGR2_FREFDIV                      RCC_PLL2CFGR2_FREFDIV_Msk                         /*!< PLLx reference input clock divide frequency ratio */
#define RCC_PLL2CFGR2_FBDIV_Pos                    (16U)
#define RCC_PLL2CFGR2_FBDIV_Msk                    (0xFFFUL << RCC_PLL2CFGR2_FBDIV_Pos)                 /*!< 0x0FFF0000 */
#define RCC_PLL2CFGR2_FBDIV                        RCC_PLL2CFGR2_FBDIV_Msk                           /*!< PLLx VCO multiplication factor */

/* Bit fields for RCC_PLL2CFGR3 register */
#define RCC_PLL2CFGR3_FRACIN_Pos                   (0U)
#define RCC_PLL2CFGR3_FRACIN_Msk                   (0xFFFFFFUL << RCC_PLL2CFGR3_FRACIN_Pos)             /*!< 0x00FFFFFF */
#define RCC_PLL2CFGR3_FRACIN                       RCC_PLL2CFGR3_FRACIN_Msk                          /*!< Fractional part of PLLx VCO multiplication factor */
#define RCC_PLL2CFGR3_DOWNSPREAD_Pos               (24U)
#define RCC_PLL2CFGR3_DOWNSPREAD_Msk               (0x1UL << RCC_PLL2CFGR3_DOWNSPREAD_Pos)              /*!< 0x01000000 */
#define RCC_PLL2CFGR3_DOWNSPREAD                   RCC_PLL2CFGR3_DOWNSPREAD_Msk                      /*!< PLLx VCO frequency modulation mode */
#define RCC_PLL2CFGR3_DACEN_Pos                    (25U)
#define RCC_PLL2CFGR3_DACEN_Msk                    (0x1UL << RCC_PLL2CFGR3_DACEN_Pos)                   /*!< 0x02000000 */
#define RCC_PLL2CFGR3_DACEN                        RCC_PLL2CFGR3_DACEN_Msk                           /*!< PLLx noise canceling DAC enable in fractional mode */
#define RCC_PLL2CFGR3_SSCGDIS_Pos                  (26U)
#define RCC_PLL2CFGR3_SSCGDIS_Msk                  (0x1UL << RCC_PLL2CFGR3_SSCGDIS_Pos)                 /*!< 0x04000000 */
#define RCC_PLL2CFGR3_SSCGDIS                      RCC_PLL2CFGR3_SSCGDIS_Msk                         /*!< PLLx spread-spectrum modulator enable */

/* Bit fields for RCC_PLL2CFGR4 register */
#define RCC_PLL2CFGR4_DSMEN_Pos                    (8U)
#define RCC_PLL2CFGR4_DSMEN_Msk                    (0x1UL << RCC_PLL2CFGR4_DSMEN_Pos)                   /*!< 0x00000100 */
#define RCC_PLL2CFGR4_DSMEN                        RCC_PLL2CFGR4_DSMEN_Msk                           /*!< PLLx delta-sigma modulator enable */
#define RCC_PLL2CFGR4_FOUTPOSTDIVEN_Pos            (9U)
#define RCC_PLL2CFGR4_FOUTPOSTDIVEN_Msk            (0x1UL << RCC_PLL2CFGR4_FOUTPOSTDIVEN_Pos)           /*!< 0x00000200 */
#define RCC_PLL2CFGR4_FOUTPOSTDIVEN                RCC_PLL2CFGR4_FOUTPOSTDIVEN_Msk                   /*!< PLLx output and post divider enable */
#define RCC_PLL2CFGR4_BYPASS_Pos                   (10U)
#define RCC_PLL2CFGR4_BYPASS_Msk                   (0x1UL << RCC_PLL2CFGR4_BYPASS_Pos)                  /*!< 0x00000400 */
#define RCC_PLL2CFGR4_BYPASS                       RCC_PLL2CFGR4_BYPASS_Msk                          /*!< PLLx FOUTPOSTDIV bypass */

/* Bit fields for RCC_PLL2CFGR5 register */
#define RCC_PLL2CFGR5_DIVVAL_Pos                   (0U)
#define RCC_PLL2CFGR5_DIVVAL_Msk                   (0xFUL << RCC_PLL2CFGR5_DIVVAL_Pos)                  /*!< 0x0000000F */
#define RCC_PLL2CFGR5_DIVVAL                       RCC_PLL2CFGR5_DIVVAL_Msk                          /*!< Modulation frequency adjustment for PLLx */
#define RCC_PLL2CFGR5_SPREAD_Pos                   (16U)
#define RCC_PLL2CFGR5_SPREAD_Msk                   (0x1FUL << RCC_PLL2CFGR5_SPREAD_Pos)                 /*!< 0x001F0000 */
#define RCC_PLL2CFGR5_SPREAD                       RCC_PLL2CFGR5_SPREAD_Msk                          /*!< Modulation depth adjustment for PLLx */

/* Bit fields for RCC_PLL2CFGR6 register */
#define RCC_PLL2CFGR6_POSTDIV1_Pos                 (0U)
#define RCC_PLL2CFGR6_POSTDIV1_Msk                 (0x7UL << RCC_PLL2CFGR6_POSTDIV1_Pos)                /*!< 0x00000007 */
#define RCC_PLL2CFGR6_POSTDIV1                     RCC_PLL2CFGR6_POSTDIV1_Msk                        /*!< PLLx VCO frequency divide level 1 */

/* Bit fields for RCC_PLL2CFGR7 register */
#define RCC_PLL2CFGR7_POSTDIV2_Pos                 (0U)
#define RCC_PLL2CFGR7_POSTDIV2_Msk                 (0x7UL << RCC_PLL2CFGR7_POSTDIV2_Pos)                /*!< 0x00000007 */
#define RCC_PLL2CFGR7_POSTDIV2                     RCC_PLL2CFGR7_POSTDIV2_Msk                        /*!< PLLx VCO frequency divide level 2 */

/* Bit fields for RCC_HSIFMONCR register */
#define RCC_HSIFMONCR_HSIREF_Pos                   (0U)
#define RCC_HSIFMONCR_HSIREF_Msk                   (0x7FFUL << RCC_HSIFMONCR_HSIREF_Pos)                /*!< 0x000007FF */
#define RCC_HSIFMONCR_HSIREF                       RCC_HSIFMONCR_HSIREF_Msk                          /*!< HSI clock count reference value */
#define RCC_HSIFMONCR_HSIMONEN_Pos                 (15U)
#define RCC_HSIFMONCR_HSIMONEN_Msk                 (0x1UL << RCC_HSIFMONCR_HSIMONEN_Pos)                /*!< 0x00008000 */
#define RCC_HSIFMONCR_HSIMONEN                     RCC_HSIFMONCR_HSIMONEN_Msk                        /*!< HSI clock period monitor enable */
#define RCC_HSIFMONCR_HSIDEV_Pos                   (16U)
#define RCC_HSIFMONCR_HSIDEV_Msk                   (0x3FUL << RCC_HSIFMONCR_HSIDEV_Pos)                 /*!< 0x003F0000 */
#define RCC_HSIFMONCR_HSIDEV                       RCC_HSIFMONCR_HSIDEV_Msk                          /*!< HSI clock count deviation value */
#define RCC_HSIFMONCR_HSIMONIE_Pos                 (30U)
#define RCC_HSIFMONCR_HSIMONIE_Msk                 (0x1UL << RCC_HSIFMONCR_HSIMONIE_Pos)                /*!< 0x40000000 */
#define RCC_HSIFMONCR_HSIMONIE                     RCC_HSIFMONCR_HSIMONIE_Msk                        /*!< HSI clock period monitor interrupt enable */
#define RCC_HSIFMONCR_HSIMONF_Pos                  (31U)
#define RCC_HSIFMONCR_HSIMONF_Msk                  (0x1UL << RCC_HSIFMONCR_HSIMONF_Pos)                 /*!< 0x80000000 */
#define RCC_HSIFMONCR_HSIMONF                      RCC_HSIFMONCR_HSIMONF_Msk                         /*!< HSI clock period monitor interrupt flag */

